{
  "name": "Edwin J. Wood",
  "title": "Senior Technology & Product Innovation Leader",
  "contact": {
    "location": "Columbia, SC",
    "phone": "803.979.2778",
    "email": "edwinjwood@gmail.com",
    "linkedin": "https://linkedin.com/in/edwin-j-wood"
  },
  "summary": "Technology and product leader with 13+ years of experience delivering digital innovation, enterprise transformation, and data visualization products. Skilled at defining multi-year roadmaps, leading high-performing teams, and turning complex data into accessible, audience-focused solutions with measurable business outcomes.",
  "coreCompetencies": [
    {
      "heading": "Leadership & Strategy",
      "text": "Product innovation, multi-year roadmap planning, portfolio governance, KPI frameworks, executive and stakeholder alignment"
    },
    {
      "heading": "Data Products & Visualization",
      "text": "Data modeling, analytics-ready datasets, dashboard development, data storytelling, web application frameworks, API design"
    },
    {
      "heading": "Cloud & Data Engineering",
      "text": "Snowflake, Azure, AWS, SQL Server, S3 data ingestion, pipeline automation, workflow orchestration (dbt, Dagster), CI/CD, containerization, data replication, reverse ETL"
    },
    {
      "heading": "Systems Integration & Applications",
      "text": "CRM systems (Salesforce, Dynamics 365), enterprise application integration, workflow automation, identity and access management, API integration, post-M&A platform migration"
    }
  ],
  "experience": [
    {
      "company": "Atlanta Braves",
      "location": "Atlanta, GA",
      "period": "2025–Present",
      "roles": [
        {
          "title": "Senior Data Engineer",
          "period": "Oct 2025–Present",
          "bullets": [
            "Build and maintain robust data pipelines to migrate enterprise data from SQL Server to Snowflake, orchestrating end-to-end workflows using dbt and Dagster.",
            "Automate ingestion and transformation of S3 files into Snowflake, modeling data through staging and fact tables, and enabling analytics-ready datasets.",
            "Support data replication workflows using Sling to synchronize curated Snowflake data back to SQL Server, ensuring downstream applications have access to the latest datasets."
          ]
        }
      ]
    },
    {
      "company": "Segra (formerly Spirit Communications & Lumos)",
      "location": "Columbia, SC",
      "period": "2012–2025",
      "roles": [
        {
          "title": "Director of Software Development",
          "period": "2023–2025",
          "bullets": [
            "Redesigned operating model into product-led pods, improving delivery focus and reducing cycle time.",
            "Established portfolio governance from business case through benefits realization, enabling KPI-driven prioritization and ROI tracking.",
            "Consolidated and modernized enterprise platforms, including CRM and customer portals, reducing cost while accelerating modernization.",
            "Directed cloud migrations and advanced CI/CD, observability, and automated testing practices to improve release safety and reliability.",
            "Partnered with executives and finance to sequence strategic programs, ensuring alignment of multi-year roadmaps with business goals."
          ]
        },
        {
          "title": "Senior Manager | Manager of Software Development | Technical Lead",
          "period": "2012–2023",
          "bullets": [
            "Built and led engineering teams delivering customer-facing products and platform integrations that supported revenue growth and efficiency.",
            "Launched Segra360, a 0-to-1 customer portal integrating OSS/BSS systems for billing, orders, service status, and analytics.",
            "Developed SegraMaps, a geospatial data visualization platform integrated with CRM to accelerate pre-sales targeting and qualification.",
            "Implemented API and integration patterns across CRM, portals, and analytics systems to standardize data flow and reporting.",
            "Executed CRM and portal migrations post-M&A, unifying platforms while minimizing business disruption."
          ]
        }
      ]
    }
  ],
  "education": {
    "school": "University of South Carolina — Columbia",
    "degree": "Bachelor of Science in Computer Science (In Progress)",
    "expectedGraduation": "May 2026"
  }
}
