{
  "name": "Edwin J. Wood",
  "title": "Senior Technology & Product Innovation Leader",
  "contact": {
    "location": "Columbia, SC",
    "phone": "803.979.2778",
    "email": "edwinjwood@gmail.com",
    "linkedin": "https://linkedin.com/in/edwin-j-wood"
  },
  "summary": "Technology and product leader with 13+ years of experience driving digital innovation, data visualization, and enterprise transformation. Skilled at defining multi-year roadmaps, building high-performing teams, and turning complex data into accessible, audience-focused digital products. Hands-on full-stack experience across cloud platforms and enterprise systems, while recognized for creating clarity, measurable outcomes, and lasting impact.",
  "coreCompetencies": [
    {
      "heading": "Leadership & Strategy",
      "text": "Digital product innovation • Multi-year roadmap planning • Portfolio governance • KPI frameworks • Executive alignment"
    },
    {
      "heading": "Data Products & Visualization",
      "text": "React • D3.js • Three.js • Interactive dashboards • Data storytelling • API-driven platforms"
    },
    {
      "heading": "Cloud & Delivery Engineering",
      "text": "Azure • AWS • GCP • Kubernetes • CI/CD (GitHub Actions, Azure DevOps) • Reliability & observability practices"
    },
    {
      "heading": "Enterprise Systems & Integration",
      "text": "Dynamics 365 • ServiceNow • Salesforce • Power Platform (Power BI, Power Apps) • Integration (MuleSoft, REST APIs) • Identity & Access (OAuth2, OIDC, MFA)"
    },
    {
      "heading": "Programming & Databases",
      "text": "JavaScript/Node.js • C#/.NET • SQL • PostgreSQL • MS SQL Server • BigQuery"
    }
  ],
  "experience": [
    {
      "company": "Segra (formerly Spirit Communications & Lumos)",
      "location": "Columbia, SC",
      "period": "2012–2025",
      "roles": [
        {
          "title": "Director of Software Development",
          "period": "2023–2025",
          "bullets": [
            "Redesigned operating model into product-led pods, improving focus, accountability, and delivery cadence.",
            "Implemented unified Jira/Azure DevOps taxonomy and dashboards for portfolio and execution visibility.",
            "Introduced portfolio lifecycle management from business case through benefits review to guide investment decisions.",
            "Consolidated overlapping enterprise platforms (CRM, portals, ServiceNow, cloud) to reduce redundancy and fund modernization.",
            "Embedded KPI frameworks (throughput, cycle time, SLA adherence) into planning and review cadences.",
            "Partnered with executives and finance to sequence multi-year initiatives and integration efforts.",
            "Directed CRM consolidation, cloud migration, and portal modernization to improve scalability and customer experience.",
            "Advanced CI/CD and observability practices to increase release safety and platform reliability."
          ]
        },
        {
          "title": "Senior Manager / Manager of Software Development / Technical Lead",
          "period": "2012–2023",
          "bullets": [
            "Led engineering teams delivering integrations, platform modernization, and customer-facing products supporting revenue growth and operational efficiency.",
            "Directed Salesforce-to-Dynamics 365 migration and developed Segra360 customer portal integrating billing, orders, service status, and analytics.",
            "Designed API and integration patterns across CRM, portals, and analytics systems to streamline data flow and reporting.",
            "Partnered with analytics teams to translate models into interactive dashboards and decision-making tools."
          ]
        }
      ]
    }
  ],
  "education": {
    "school": "University of South Carolina — Columbia",
    "degree": "Bachelor of Science in Computer Science (In Progress)",
    "expectedGraduation": "May 2026"
  }
}
