{
  "name": "Edwin J. Wood",
  "title": "Technology & Product Leader | Enterprise Platforms, Data & Digital Transformation",
  "contact": {
    "email": "edwinjwood@gmail.com",
    "linkedin": "https://linkedin.com/in/edwin-j-wood",
    "website": "https://edwinjwood.github.io"
  },
  "summary": "Technology and product leader with 13+ years of experience guiding enterprise modernization, digital platform strategy, and data ecosystem transformation across complex operational environments. Proven track record building engineering teams, aligning multi-year technology roadmaps to business priorities, and delivering mission-critical systems that improve operational visibility, customer experience, and enterprise scalability. Combines executive-level strategic leadership with deep hands-on engineering expertise across cloud platforms, enterprise applications, integrations, and analytics infrastructure.",
  "skills": [
    {
      "heading": "Technology Leadership & Strategy",
      "text": "Enterprise technology roadmaps, organizational operating models, portfolio governance, KPI frameworks, executive stakeholder alignment, digital transformation leadership"
    },
    {
      "heading": "Data Platforms & Analytics",
      "text": "Data architecture, analytics-ready modeling, reporting ecosystems, dashboard strategy, data governance, API-driven data services, enterprise visualization platforms"
    },
    {
      "heading": "Cloud & Data Engineering",
      "text": "Snowflake, Azure, AWS, SQL Server, S3 ingestion, automated pipelines, workflow orchestration (dbt, Dagster), CI/CD, containerization, data replication, reverse ETL"
    },
    {
      "heading": "Enterprise Systems & Integration",
      "text": "Salesforce, Dynamics 365, enterprise system integration, workflow automation, identity and access management, API architecture, post-M&A platform consolidation"
    }
  ],
  "experience": [
    {
      "company": "Atlanta Braves",
      "location": "Columbia, SC",
      "period": "2025–Present",
      "roles": [
        {
          "title": "Senior Data Engineer",
          "period": "Oct 2025–Present",
          "bullets": [
            "Lead development of enterprise data pipelines supporting migration from SQL Server to Snowflake, enabling scalable analytics and cross-system reporting.",
            "Design automated ingestion and transformation workflows using dbt and orchestration frameworks to deliver trusted, analytics-ready datasets across multiple business domains.",
            "Implement layered data models, reusable transformation logic, and environment-aware deployment practices that improve reliability, maintainability, and auditability of enterprise reporting infrastructure.",
            "Enable synchronization between cloud and on-premises systems to ensure curated enterprise datasets remain consistently available for downstream analytics and operational decision-making."
          ]
        }
      ]
    },
    {
      "company": "SEGRA (formerly Spirit Communications & Lumos)",
      "location": "Columbia, SC",
      "period": "2012–2025",
      "roles": [
        {
          "title": "Director of Software Development",
          "period": "2023–2025",
          "bullets": [
            "Redesigned the engineering organization into product-aligned delivery pods with governance from business case through measurable benefits realization, enabling KPI-driven prioritization, ROI tracking, and improved execution focus.",
            "Led enterprise modernization initiatives across CRM ecosystems, customer portals, and integration platforms, supporting cloud adoption and improved operational scalability.",
            "Partnered with executive leadership and finance to sequence strategic programs and align multi-year technology roadmaps with corporate growth priorities.",
            "Directed post-acquisition platform consolidation efforts that reduced system complexity, improved reliability, and strengthened long-term technology sustainability.",
            "Drove adoption of CI/CD, automated testing, and observability practices that improved delivery confidence and release stability across engineering teams."
          ]
        },
        {
          "title": "Senior Manager | Manager of Software Development | Technical Lead",
          "period": "2012–2023",
          "bullets": [
            "Built and led engineering teams delivering major enterprise customer platforms including SEGRA360, a 0-to-1 customer portal integrating OSS/BSS systems for billing, orders, and service visibility.",
            "Led development of SEGRAmaps, a geospatial intelligence platform integrating CRM and network data to support sales, engineering, and operational planning decisions.",
            "Established API-driven integration patterns across CRM, customer portals, and analytics systems to standardize enterprise data flow and reporting capabilities.",
            "Oversaw enterprise reporting strategy across sales, finance, and operations using PowerBI dashboards embedded directly within business applications.",
            "Led data governance and quality initiatives including deduplication strategies, workflow validation rules, and integration-level controls to improve enterprise data accuracy and reporting trust.",
            "Supported large-scale system migrations involving Salesforce, Dynamics 365, and enterprise integrations while minimizing operational disruption."
          ]
        }
      ]
    }
  ],
  "education": {
    "school": "University of South Carolina — Columbia",
    "degree": "Bachelor of Science in Computer Science",
    "expectedGraduation": "May 2026"
  }
}