{
  "name": "Edwin J. Wood",
  "title": "Senior Technology & Product Innovation Leader",
  "contact": {
    
    "email": "edwinjwood@gmail.com",
    "linkedin": "https://linkedin.com/in/edwin-j-wood",
    "website": "https://edwinjwood.github.io"
  },
  "summary": "Technology and product leader with 13+ years of experience driving digital innovation, enterprise transformation, and data platform modernization. At SEGRA, led and built engineering teams, modernized platforms, and delivered measurable business outcomes through hands-on technical leadership. Currently building robust data pipelines and analytics solutions as a Senior Data Engineer for the Atlanta Braves. Equally effective as a strategic leader and as a hands-on engineer solving complex data challenges.",
  "skills": [
    {
      "heading": "Leadership & Strategy",
      "text": "Product innovation, multi-year roadmap planning, portfolio governance, KPI frameworks, executive and stakeholder alignment"
    },
    {
      "heading": "Data Products & Visualization",
      "text": "Data modeling, analytics-ready datasets, dashboard development, data storytelling, web application frameworks, API design"
    },
    {
      "heading": "Cloud & Data Engineering",
      "text": "Snowflake, Azure, AWS, SQL Server, S3 data ingestion, pipeline automation, workflow orchestration (dbt, Dagster), CI/CD, containerization, data replication, reverse ETL"
    },
    {
      "heading": "Systems Integration & Applications",
      "text": "CRM systems (Salesforce, Dynamics 365), enterprise application integration, workflow automation, identity and access management, API integration, post-M&A platform migration"
    }
  ],
  "experience": [
    {
      "company": "Atlanta Braves",
      "location": "Atlanta, GA",
      "period": "2025–Present",
      "roles": [
        {
          "title": "Senior Data Engineer",
          "period": "Oct 2025–Present",
          "bullets": [
            "Build and maintain robust data pipelines to migrate enterprise data from SQL Server to Snowflake, orchestrating end-to-end workflows using dbt and Dagster.",
            "Automate ingestion and transformation of S3 files into Snowflake, modeling data through staging and fact tables, and enabling analytics-ready datasets.",
            "Support data replication workflows using Sling to synchronize curated Snowflake data back to SQL Server, ensuring downstream applications have access to the latest datasets."
          ]
        }
      ]
    },
    {
      "company": "SEGRA (formerly Spirit Communications & Lumos)",
      "location": "Columbia, SC",
      "period": "2012–2025",
      "roles": [
        {
          "title": "Director of Software Development",
          "period": "2023–2025",
          "bullets": [
            "Redesigned operating model into product-led pods with portfolio governance from business case through benefits realization, enabling KPI-driven prioritization, ROI tracking, and improved delivery focus.",
            "Consolidated and modernized enterprise platforms including CRM (Salesforce, Dynamics 365) and customer portals, reducing costs while accelerating platform modernization and cloud migration initiatives.",
            "Partnered with executives and finance to sequence strategic programs and align multi-year roadmaps with business goals, advancing CI/CD, observability, and automated testing practices."
          ]
        },
        {
          "title": "Senior Manager | Manager of Software Development | Technical Lead",
          "period": "2012–2023",
          "bullets": [
            "Built and led engineering teams delivering customer-facing products including SEGRA360 (0-to-1 customer portal integrating OSS/BSS systems for billing, orders, and service status) and SEGRAmaps (geospatial data visualization platform with CRM integration).",
            "Implemented API and integration patterns across CRM, portals, and analytics systems to standardize data flow and reporting, executing post-M&A platform migrations while minimizing business disruption."
          ]
        }
      ]
    }
  ],
  "education": {
    "school": "University of South Carolina — Columbia",
    "degree": "Bachelor of Science in Computer Science (In Progress)",
    "expectedGraduation": "May 2026"
  }
}
