{
  "name": "Edwin J. Wood",
  "title": "Senior Technology & Product Innovation Leader",
  "contact": {
    "location": "Columbia, SC",
    "phone": "803.979.2778",
    "email": "edwinjwood@gmail.com",
    "linkedin": "https://linkedin.com/in/edwin-j-wood"
  },
  "summary": "Technology and product leader with 13+ years of experience driving digital innovation, data visualization, and enterprise transformation. Skilled at defining multi-year roadmaps, building high-performing teams, and turning complex data into accessible, audience-focused digital products. Hands-on full-stack experience across cloud platforms and enterprise systems, while recognized for creating clarity, measurable outcomes, and lasting impact.",
  "coreCompetencies": [
    {
      "heading": "Leadership & Strategy",
      "text": "Digital product innovation • Multi-year roadmap planning • Portfolio governance • KPI frameworks • Executive alignment"
    },
    {
      "heading": "Data Products & Visualization",
      "text": "React • D3.js • Three.js • Interactive dashboards • Data storytelling • API-driven platforms"
    },
    {
      "heading": "Cloud & Delivery Engineering",
      "text": "Azure • AWS • GCP • Kubernetes • CI/CD (GitHub Actions, Azure DevOps) • Reliability & observability practices"
    },
    {
      "heading": "Enterprise Systems & Integration",
      "text": "Dynamics 365 • ServiceNow • Salesforce • Power Platform (Power BI, Power Apps) • Integration (MuleSoft, REST APIs) • Identity & Access (OAuth2, OIDC, MFA)"
    },
    {
      "heading": "Programming & Databases",
      "text": "JavaScript/Node.js • C#/.NET • SQL • PostgreSQL • MS SQL Server • BigQuery"
    }
  ],
  "experience": [
    {
      "company": "Segra (formerly Spirit Communications & Lumos)",
      "location": "Columbia, SC",
      "period": "2012–2025",
      "roles": [
        {
  "title": "Director of Software Development",
  "period": "2023–2025",
  "bullets": [
    "Redesigned operating model into product-led pods, improving delivery focus, accountability, and cadence.",
    "Unified Jira and Azure DevOps into a single taxonomy and dashboard framework, providing clear portfolio visibility and KPIs.",
    "Established portfolio lifecycle management from business case to benefits review, enabling data-driven investment decisions.",
    "Consolidated redundant platforms (CRM, portals) into ServiceNow to reduce cost and accelerate modernization.",
    "Directed CRM consolidation, cloud migration, and portal modernization, improving scalability, security, and customer experience.",
    "Advanced CI/CD and observability practices, increasing release confidence and platform reliability.",
    "Partnered with executives and finance to sequence multi-year strategic initiatives and integration efforts."
  ]
},
{
  "title": "Senior Manager | Manager of Software Development | Technical Lead",
  "period": "2012–2023",
  "bullets": [
    "Built and led engineering teams delivering integrations, platform modernization, and customer-facing products that improved revenue growth and operational efficiency.",
    "Established API and integration frameworks across CRM, portals, and analytics systems to standardize data flow and reporting.",
    "Launched Segra360, a 0-to-1 customer portal integrating OSS/BSS systems (billing, orders, ticketing, and service status) — improved self-service engagement and reduced support volume by ~40%.",
    "Created SegraMaps, a 0-to-1 geospatial data visualization platform integrated with CRM — enabled pre-sales teams to visualize network reach, accelerate deal qualification, and improve pricing and targeting accuracy.",
    "Partnered with analytics teams to translate predictive models into interactive dashboards and visualization tools for sales and operations.",
    "Directed Salesforce-to-Dynamics 365 migration post-M&A, aligning commercial processes and migrating pipeline data to unify sales operations."
  ]
}
      ]
    }
  ],
  "education": {
    "school": "University of South Carolina — Columbia",
    "degree": "Bachelor of Science in Computer Science (In Progress)",
    "expectedGraduation": "May 2026"
  }
}
