{
  "name": "Edwin J. Wood",
  "title": "Senior Technology & Product Innovation Leader",
  "contact": {
    "location": "Columbia, SC",
    "phone": "803.979.2778",
    "email": "edwinjwood@gmail.com",
    "linkedin": "https://linkedin.com/in/edwin-j-wood"
  },
  "summary": "Technology and product leader with 13+ years of experience driving digital innovation, data visualization, and enterprise transformation. Skilled at defining multi-year roadmaps, building high-performing teams, and turning complex data into accessible, audience-focused digital products. Hands-on full-stack experience across cloud platforms and enterprise systems, while recognized for creating clarity, measurable outcomes, and lasting impact.",
  "coreCompetencies": [
    {
      "heading": "Leadership & Strategy",
      "text": "Digital product innovation • Multi-year roadmap planning • Portfolio governance • KPI frameworks • Executive alignment"
    },
    {
      "heading": "Data Products & Visualization",
      "text": "Modern web frameworks • Interactive dashboards • Data storytelling • API-driven platforms"
    },
    {
      "heading": "Cloud & Delivery Engineering",
      "text": "Cloud platforms • Container orchestration • CI/CD pipelines • Reliability & observability"
    },
    {
      "heading": "Enterprise Systems & Integration",
      "text": "CRM & enterprise platforms • Integration patterns • Workflow automation • Identity & access"
    },
    {
      "heading": "Programming & Databases",
      "text": "Full-stack development • Object-oriented languages (C#, Java, Python) • Relational & NoSQL databases • SQL"
    }
  ],
  "experience": [
    {
      "company": "Segra (formerly Spirit Communications & Lumos)",
      "location": "Columbia, SC",
      "period": "2012–2025",
      "roles": [
        {
  "title": "Director of Software Development",
  "period": "2023–2025",
    "bullets": [
    "Redesigned operating model into product-led pods, improving delivery focus and reducing cycle time.",
    "Created unified delivery visibility and portfolio KPIs to improve prioritization and investment decisions.",
    "Established portfolio lifecycle governance from business case through benefits realization to improve ROI tracking.",
    "Consolidated and modernized enterprise platforms and led cloud migrations to reduce operating cost, improve reliability, and simplify operations.",
    "Integrated CI/CD, observability, and automated end-to-end testing into delivery pipelines to enhance release confidence.",
    "Partnered with executives and finance to sequence strategic programs and improve on-time delivery."
  ]
},
{
  "title": "Senior Manager | Manager of Software Development | Technical Lead",
  "period": "2012–2023",
    "bullets": [
    "Built and led engineering teams delivering customer-facing products and platform integrations that improved revenue and efficiency.",
    "Implemented integration patterns and APIs to standardize data flow and enable reliable reporting.",
    "Delivered portals and visualization tools to increase self-service adoption and support commercial decisions.",
    "Partnered with analytics to operationalize insights through dashboards and product features.",
    "Executed system migrations and integrations post-reorg to align processes and minimize disruption."
  ]
}
      ]
    }
  ],
  "education": {
    "school": "University of South Carolina — Columbia",
    "degree": "Bachelor of Science in Computer Science (In Progress)",
    "expectedGraduation": "May 2026"
  }
}
